1일차
올래국수:제주도 고기국수 맛집
삼무국수:제주도 고기국수 맛집
자매국수:제주도 고기국수 맛집 삼대천왕 나옴
덤장:갈치구이

함덕해수용장위치
델문도 카페 디저트
바람벽에흰당나귀카페,디저트
쪼끌락카페,디저트 김녕라떼로 유명한 제주도 디저트카페

백리향:백반집 7000 갈치구이 13000
제주또바기:보말칼국수
오드랑베이커리:빵
버드나무집:보말칼구수 목요일휴무 10000 해물손칼국수
해녀촌:회국수가 유명 9000
월정해녀식당:통갈치구이45000
함덕밀면국수 9000, 흑돼지연탄한판13000


롯데호텔
바다다카페,디저트
카페세렌디카페,디저트
이정의댁카페
옐로우카페카페,디저트
르피크닉카페,디저트

한돈가 100그람 10000
오르막가든 흑돼지 17000
중문흑돼지 190 18000
쉬는팡가든 200 18000
제주흑도새기 200 18000
꺼멍목장 200 19000
참이쁜돼지 200  19000



국수바다본점 고기국수8000
영실국수 8000 해물짬뽕15000
중문수두리보말칼국수 9000
중문국수마을국수 7000
제주한라국수 국수 8000

제주미향 갈치구이 45000

피제리아3657피자28000
뀌에떼이탈리아음식16000
